using FigureLibrary.Figures;

/*
 * По заданию не совсем понятно, нужны ли фигуры в принципе - может быть было бы достаточно просто 
 * определённых интерфейсов, которые бы возвращали нужный результат без создания фигуры и принимали аргументы
 * радиуса/сторон и прочего.
 * 
 * Также не ясно требуется ли проверка существования фигуры и правильности аргументов. 
 * 
 * Текущее решение через наследование, когда для каждой новой фигуры нужно будет наследоваться и в перспективе
 * создавать миллион классов - мне не нравится. :) Как сделать его более абстрактным и приемлемым своими руками
 * на текущий момент не знаю).
 */

var circle = new Circle(5);

Console.WriteLine(circle.GetSquare());

var triangle = new Triangle(4, 5, 6);

Console.WriteLine(triangle.GetSquare());
Console.WriteLine(triangle.IsFigureRight());